"""
P8784 [蓝桥杯 2022 省 B] 积木画
https://www.luogu.com.cn/problem/P8784

狀態機DP
f[i][0] 表示第 i 直行沒有方塊的方案數
f[i][1] 表示第 i 直行只有上面有方塊的方案數
f[i][2] 表示第 i 直行只有下面有方塊的方案數
f[i][3] 表示第 i 直行上下都有方塊的方案數
"""
MOD = int(1e9 + 7)
n = int(input())
# f = [[0] * 4 for _ in range(n + 1)]
# f[1][0] = f[1][3] = 1
# for i in range(2, n + 1):
#     f[i][0] = f[i - 1][3]
#     f[i][1] = (f[i - 1][0] + f[i - 1][2]) % MOD
#     f[i][2] = (f[i - 1][0] + f[i - 1][1]) % MOD
#     f[i][3] = (f[i - 1][0] + f[i - 1][1] + f[i - 1][2] + f[i - 1][3]) % MOD
# print(f[n][3])
f = [[0] * 4 for _ in range(2)]
f[1 & 1][0] = f[1 & 1][3] = 1
for i in range(2, n + 1):
    f[i & 1][0] = f[(i - 1) & 1][3]
    f[i & 1][1] = (f[(i - 1) & 1][0] + f[(i - 1) & 1][2]) % MOD
    f[i & 1][2] = (f[(i - 1) & 1][0] + f[(i - 1) & 1][1]) % MOD
    f[i & 1][3] = (f[(i - 1) & 1][0] + f[(i - 1) & 1][1] + f[(i - 1) & 1][2] + f[(i - 1) & 1][3]) % MOD
print(f[n & 1][3])